<!-- <pre>
<?php

// $m = [99,88, 77, 66, 55];
// var_dump($m);

// ===========функция in_array - которая проверяет, есть ли значение в массиве (также может использоваться и переменная). Функция возвращает либо true, либо foulse, если значение есть.
// var_dump( in_array(55,$m)); // проверяем, есть ли значение 88 в массиве - true. Значение находится в массиве.
// if (in_array(55,$m)) { //  если in_array(55,$m) есть в массиве, то выводим 1, если нет, то выводим 2.
//   echo 1;
// }
// else {
//   echo 0;
// }

// ===========функция max - находит максимальное значение в массиве (также может использоваться и переменная). Функция возвращает либо true, либо foulse, если значение есть.
// echo 'max';
// echo '<hr>';
// echo ( max($m)); // функция показывает значение 99


// ===========функция sort - позволяет сортировать массив (также может использоваться и переменная). Имеет множество флажков. ! функция возвращает либо true, либо faulse.
// echo '<hr>';
// echo 'sort';
// echo '<br>';
// $m2 = [3,4,2,1,4,5,1,2];
// sort($m2); // данной командой мы сортируем массив. Массив сортируется по возрастанию.
// print_r($m2); // print_r применяется для красивого вывести массив 

// ===========функция array_reverse - возвращает нам новый массив, который мы можем использовать
// echo '<hr>';
// echo '<br>';
// $m3 = ['a', 'b', 'c', 'd'];
// $b = array_reverse($m3);
// print_r($m3); // 




// // =========== array_push - добавляет значение в конец массива
// echo '<hr>';
// echo '<br>';
// $m4 = ['a', 'b', 'c', 'd'];
// $m4[] = 'hello'; // '' - указываем то значение, которое хотим присвоит
// array_push($m4,7);
// print_r($m4); // 






// =========== array_shift - удаляет элемент с начала массива. Если массив большой (10000 и более), то перед добавлением значения в начало массива - подумай, оно тебе надо (так как будет большая нагрузка на процессор - двигать весь массив).
// echo '<hr>';
// echo '<br>';
// $m4 = ['a', 'b', 'c', 'd'];
// array_shift($m4);
// print_r($m4); // 






// =========== array_pop - удаляет элемент с конца.
// echo '<hr>';
// echo '<br>';
// $m4 = ['a', 'b', 'c', 'd'];
// array_pop($m4);
// print_r($m4); // 




// =========== array_shift + array_pop - удаляет элемент с переди и с конца.
// echo '<hr>';
// echo '<br>';
// $m4 = ['a', 'b', 'c', 'd'];
// array_shift($m4);
// array_pop($m4);
// print_r($m4); // 





// ===========
// echo '<hr>';
// echo '<br>';







// ===========
// echo '<hr>';
// echo '<br>'; -->